In [16]:
!pip install pandas numpy

Requirement already satisfied: pandas in c:\python311\lib\site-packages (2.1.0)
Requirement already satisfied: numpy in c:\python311\lib\site-packages (1.24.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\stevenhdz\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\python311\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\stevenhdz\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [3]:
import pandas as pd
import numpy as np

Option 1

In [4]:
# array
data = np.array([[1,4],[2,5],[3,4]])

In [7]:
# dataframe
df = pd.DataFrame(data, index = ['row1','row2','row3'], columns = ['col1', 'col2'])

In [11]:
df

      col1  col2
row1     1     4
row2     2     5
row3     3     4

Option 2

In [ ]:
#array list
data = [[1,4],[2,5],[3,4]]

In [9]:
#dataframe
df = pd.DataFrame(data, index = ['row1','row2','row3'], columns = ['col1', 'col2'])

In [10]:
df

      col1  col2
row1     1     4
row2     2     5
row3     3     4

dataframe usando diccionarios

In [12]:
#list
states = ['California','Texas','Florida','New york']
population = [44444,22222,3333,1111]

In [13]:
#diccionario
dict_states = {'States': states, 'Population': population}

In [14]:
#create dataframe
df_population = pd.DataFrame(dict_states)

In [15]:
df_population

       States  Population
0  California       44444
1       Texas       22222
2     Florida        3333
3    New york        1111

csv

In [19]:
#datasets -> dataframe
df_exams = pd.read_csv('./StudentsPerformance.csv')

In [20]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86